[
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"The supplication of a Muslim for his (Muslim) brother in his absence will certainly be answered. Everytime he makes a supplication for good for his brother, the angel appointed for this particular task says: 'Ameen! May it be for you, too'.\"",
        "reference": "Riyad as-Salihin 1495"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"He is not a believer whose stomach is filled while his neighbor goes hungry.\"",
        "reference": "Al-Adab Al-Mufrad 112"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"No Muslim is afflicted by difficulty, continuous pain, anxiety, grief, injury, or care, or even by a thorn with which he is pierced, without God thereby making an atonement for his sins.\"",
        "reference": "Mishkat al-Masabih 1537"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"A Muslim has five duties towards another Muslim: to return a salutation, visit the sick, follow funerals, accept an invitation and say ‘God have mercy on you’ when one sneezes.\"",
        "reference": "Mishkat al-Masabih 1524"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"Whoever travels a path in search of knowledge, Allah will make easy for him a path to Paradise. People do not gather in the houses of Allah, reciting the book of Allah and studying it together, but that tranquility will descend upon them, mercy will cover them, angels will surround them, and Allah will mention them to those near him.\"",
        "reference": "Sahih Muslim 2699"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"Verily, the angels lower their wings for the seeker of knowledge. The inhabitants of the heavens and earth, even the fish in the depths of the water, seek forgiveness for the scholar. The virtue of the scholar over the worshiper is like the superiority of the moon over the stars. The scholars are the inheritors of the Prophets. They do not leave behind gold or silver coins, but rather they leave behind knowledge. Whoever has taken hold of it has been given an abundant share.\"",
        "reference": "Sunan Abī Dawud 3641"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"Verily, Allah does not look at your appearance or wealth, but rather he looks at your hearts and actions.\"",
        "reference": "Sahih Muslim 2564"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"No man is given authority over ten people or more but that he will come to Allah on the Day of Resurrection with his hands in shackles up to his neck. His freedom is his righteousness, or his imprisonment is his sin. The first of it is blame, the middle of it is regret, and the last of it is disgrace on the Day of Resurrection.\"",
        "reference": "Musnad Ahhmad 22300"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"Whoever believes in Allah and the Last Day, let him uphold his family ties.\"",
        "reference": "Sahih al-Bukhari 6138"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"The strong are not the best wrestlers. Verily, the strong are only those who control themselves when they are angry.\"",
        "reference": "Sahih al-Bukhari 5763"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"Whoever is pleased to have his provision expanded and his life span extended, let him keep good relations with his family.\"",
        "reference": "Sahih al-Bukhari 2067"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"There is nothing swallowed with a greater reward from Allah than a servant who swallows his rage, seeking thereby the countenance of Allah.\"",
        "reference": "Sunan Ibn Majah 4189"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"No two Muslims meet each other and shake hands but that Allah forgives them before they part.\"",
        "reference": "Sunan al-Tirmidhi 2727"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"Verily, when the believer meets another believer, greets him with peace, and shakes his hand, the sins of them both will shed like leaves falling from a tree.\"",
        "reference": "al-Muʻjam al-Awsat 253"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"Whoever has three qualities will have completed the faith: fairness from yourself to others, offering peace to the world, and spending in charity even while poor.\"",
        "reference": "Sahih al-Bukhari 28"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"O people, spread peace, feed the hungry, and pray at night when people are sleeping and you will enter Paradise in peace.\"",
        "reference": "Sunan al-Tirmidhi 2485"
    },
    {
        "hadith": "The Messenger of Allah (ﷺ) said, \"Verily, whoever has been given the quality of kindness has been given his share of good in this life and in the Hereafter. Maintaining family ties, good character, and good treatment of neighbors will build their heavenly abodes and increase their life spans.\"",
        "reference": "Musnad Ahmad 25259"
    }
]